/*******************************************************************************
* 文 件 名: sched_port.c
* 创 建 者: Keda Huang
* 版    本: V1.0
* 创建日期: 2016-11-14
* 文件说明: 事件驱动调度器的底层接口
*******************************************************************************/

#include "sched_proto.h"
/*******************************************************************************

                                    底层接口

*******************************************************************************/
/* 调度器底层初始化 */
void schedPortInit(void)
{

}

/**
 * 事件块复制
 *
 * @param dst: 目标事件块指针
 *
 * @param src: 源事件块指针
 *
 * @return: 目标事件块指针
 */
SchedEvent_t *schedPortEvtcpy(SchedEvent_t *dst, const SchedEvent_t *src)
{
    dst->sig = src->sig;
    dst->msg = src->msg;
    return (dst);
}
